In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data={
    'Name':['Babar','kholi','Rohit',"Rizwan"],
    'Age':[None,39,38,None],
    'Runs':[10000,20000,None,None]
}

In [3]:
df=pd.DataFrame(data
                )

In [4]:
df

     Name   Age     Runs
0   Babar   NaN  10000.0
1   kholi  39.0  20000.0
2   Rohit  38.0      NaN
3  Rizwan   NaN      NaN

In [5]:
df.isnull().sum()

Name    0
Age     2
Runs    2
dtype: int64

In [6]:
df['Age']=df['Age'].fillna(df['Age'].mean(),inplace=True)

C:\Users\khair bakhsh\AppData\Local\Temp\ipykernel_13888\3291053296.py:1: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  df['Age']=df['Age'].fillna(df['Age'].mean(),inplace=True)

In [7]:
df

     Name   Age     Runs
0   Babar  38.5  10000.0
1   kholi  39.0  20000.0
2   Rohit  38.0      NaN
3  Rizwan  38.5      NaN

In [8]:
df['Runs']=df['Runs'].fillna(df['Runs'].mean(),inplace=True)

C:\Users\khair bakhsh\AppData\Local\Temp\ipykernel_13888\817067196.py:1: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  df['Runs']=df['Runs'].fillna(df['Runs'].mean(),inplace=True)

In [9]:
df

     Name   Age     Runs
0   Babar  38.5  10000.0
1   kholi  39.0  20000.0
2   Rohit  38.0  15000.0
3  Rizwan  38.5  15000.0

In [10]:
from sklearn.preprocessing import LabelEncoder


df=pd.read_csv('Employee Dataset - AR1.csv')
df2=df.copy()
le=LabelEncoder()
df2['is_male']=le.fit_transform(df2['Gender'])
df2['status']=le.fit_transform(df2['Marital Status'])

In [11]:
df2['is_male']

0    1
1    1
2    1
3    0
4    1
5    1
6    0
7    1
Name: is_male, dtype: int64

In [12]:
df2

,Employee Name,Age,Last Working Day,Department,Education,Gender,Marital Status,Monthly Income,Years of Experience,Percent Salary Hike,Performance Rating,is_male,status
0,Jitesh,41,31-12-9999,Training,Masters,Male,Single,5993,8,11,3,1,2
1,Sanjit,49,31-12-9999,Sales,Masters,Male,Married,5130,1,23,4,1,1
2,John,37,31-12-9999,R&D,Doctorate,Male,Single,2090,6,15,3,1,2
3,Sandra,33,31-12-9999,Software Development,Undergraduate,Female,Married,2909,1,11,3,0,1
4,Madhu,27,31-12-9999,R&D,Masters,Male,Married,3468,9,12,3,1,1
5,Robert,32,31-12-9999,R&D,Masters,Male,Single,3068,0,13,3,1,2
6,Megan,59,31-12-9999,Software Development,Masters,Female,Married,2670,4,20,4,0,1
7,Matt,30,31-12-9999,R&D,Doctorate,Male,Divorced,2693,1,22,4,1,0

In [13]:
df_onehot = pd.get_dummies(df2, columns=['Education'],dtype='int')

In [14]:
df_onehot

,Employee Name,Age,Last Working Day,Department,Gender,Marital Status,Monthly Income,Years of Experience,Percent Salary Hike,Performance Rating,is_male,status,Education_Doctorate,Education_Masters,Education_Undergraduate
0,Jitesh,41,31-12-9999,Training,Male,Single,5993,8,11,3,1,2,0,1,0
1,Sanjit,49,31-12-9999,Sales,Male,Married,5130,1,23,4,1,1,0,1,0
2,John,37,31-12-9999,R&D,Male,Single,2090,6,15,3,1,2,1,0,0
3,Sandra,33,31-12-9999,Software Development,Female,Married,2909,1,11,3,0,1,0,0,1
4,Madhu,27,31-12-9999,R&D,Male,Married,3468,9,12,3,1,1,0,1,0
5,Robert,32,31-12-9999,R&D,Male,Single,3068,0,13,3,1,2,0,1,0
6,Megan,59,31-12-9999,Software Development,Female,Married,2670,4,20,4,0,1,0,1,0
7,Matt,30,31-12-9999,R&D,Male,Divorced,2693,1,22,4,1,0,1,0,0

In [15]:
from sklearn.metrics import confusion_matrix
y_true=[1,0,0,1,0,0,1,1,0]
y_pred=[0,1,1,0,1,0,0,1,0]
cm=confusion_matrix(y_true,y_pred)
cm

array([[2, 3],
       [3, 1]])

In [16]:
from sklearn.metrics import mean_absolute_error, mean_squared_error

In [17]:
import numpy as np
real_score=[80,90,70,100,80]
predicted_score=[70,80,95,96,90]
mae=mean_absolute_error(real_score,predicted_score)
mse=mean_squared_error(real_score,predicted_score)
rmse=np.sqrt(mse)
mae

11.8

In [18]:
mse

188.2

In [19]:
rmse

np.float64(13.718600511714014)